Heatsink-Optimization-Series/episode-02-baseline/feature-refined-mesh/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (3 0 0);
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    "(side_left|side_right)"
    {
        type            slip;
    }
    "heatsink.*"
    {
        type            noSlip;
    }
}
