Heatsink-Optimization-Series/episode-02-baseline/feature-refined-mesh/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;
