Heatsink-Optimization-Series/episode-02-baseline/feature-refined-mesh/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    heatsink.stl
    {
        type triSurfaceMesh;
        name heatsink;
    }

    // Refinement box around the heatsink and wake region
    refinementBox
    {
        type searchableBox;
        min (-0.005 0 -0.005);
        max (0.10  0.03  0.065);
    }
}

castellatedMeshControls
{
    maxLocalCells       100000;
    maxGlobalCells      2000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    // Feature-edge refinement is ENABLED here. It works because this variant
    // uses a FLUSH base (base_extension=0, base bottom exactly at y=0), so every
    // feature edge lies inside the domain. With the default protruding base
    // (used by the main ../case), these edges fall below the domain floor and
    // snappyHexMesh hangs at "Feature refinement iteration 0" — which is why the
    // main case disables features and uses surface refinement only.
    features
    (
        {
            file "heatsink.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        heatsink
        {
            level (2 3);
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1e15 1));
        }
    }

    locationInMesh (0.03 0.04 0.03);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              100;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
        "heatsink.*"
        {
            nSurfaceLayers 3;
        }
    }
    expansionRatio          1.2;
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    #include "meshQualityDict"
}

mergeTolerance 1e-6;
